In [2]:
import pandas as pd

In [5]:
data_frame = pd.read_csv('data/friend_list.csv')
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
# 앞에 두개만 보겠다.
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [7]:
# 뒤에 두개만 보겠다.
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [8]:
# 데이터 컬럼별로 출력, Data형은 Serise 다.
type(data_frame.age)

pandas.core.series.Series

In [9]:
# python 은 list 사용한다.
list_tmp = [1,2,3]

In [11]:
# 시리즈 만들기
s1 = pd.core.series.Series( [1, 2, 3] )
s1

0    1
1    2
2    3
dtype: int64

In [16]:
# 시리즈 만들기
s2 = pd.core.series.Series( ['one', 'two', 'three'] )
s2

0      one
1      two
2    three
dtype: object

In [15]:
# 데이터 프레임 만들기
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three